# Pandas Tutorial

In [1]:
import pandas as pd

## PART 1: Pandas Basics (Reading Data Files, DataFrames, Data Selection)

### Reading CSV

In [2]:
# Reading with custom delimiter
df = pd.read_csv("zoo.csv", delimiter=",")
df.head(3)

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550

In [3]:
# Reading when column names are not included
df =pd.read_csv('data_2.csv', delimiter=';', \
            names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

### Sampling Data

In [4]:
df.head() # First 5 Data

           my_datetime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

In [5]:
df.tail() # Last 5 Data

              my_datetime event    country     user_id   source          topic
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

In [6]:
df.sample(5) # Random 5 data

              my_datetime event    country     user_id   source          topic
1699  2018-01-01 22:57:11  read  country_2  2458152960   Reddit  South America
1403  2018-01-01 19:06:46  read  country_5  2458152664      SEO  North America
683   2018-01-01 09:22:28  read  country_5  2458151944   Reddit           Asia
1588  2018-01-01 21:29:09  read  country_2  2458152849  AdWords         Europe
1076  2018-01-01 14:31:42  read  country_5  2458152337   Reddit  South America

### Select Specific Series

In [7]:
df2 = df[['my_datetime', 'source', 'topic']] # Get only some series - note [[]]
df2.head()

           my_datetime   source          topic
0  2018-01-01 00:01:01      SEO  North America
1  2018-01-01 00:03:20      SEO  South America
2  2018-01-01 00:04:01  AdWords         Africa
3  2018-01-01 00:04:02  AdWords         Europe
4  2018-01-01 00:05:03   Reddit  North America

In [8]:
df2 = df.my_datetime # Can select one series(columnb) as objects
df2.head()

0    2018-01-01 00:01:01
1    2018-01-01 00:03:20
2    2018-01-01 00:04:01
3    2018-01-01 00:04:02
4    2018-01-01 00:05:03
Name: my_datetime, dtype: object

### Filter Rows

In [9]:
df2 = df[df.source == 'SEO'] # Select rows where source is equal to SEO
df2.head()

            my_datetime event    country     user_id source          topic
0   2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1   2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11  2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15  2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16  2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America

### Example

**Select the user_id, the country and the topic columns for the users who are from country_2! Print the first five rows only!**

In [10]:
df[df.country == 'country_2'][['user_id', 'country', 'topic']].head()

       user_id    country   topic
6   2458151267  country_2  Europe
13  2458151274  country_2  Europe
17  2458151278  country_2    Asia
19  2458151280  country_2    Asia
20  2458151281  country_2    Asia

## PART 2: Aggregation and Grouping

In [11]:
df = pd.read_csv('zoo.csv', delimiter=',')
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

### Basic Counting and Summing Cells

In [12]:
df.count() # Count values in each column

animal        22
uniq_id       22
water_need    22
dtype: int64

In [13]:
df.sum() # Take sum of each column (if string, appends)

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [14]:
df.max()

animal        zebra
uniq_id        1022
water_need      600
dtype: object

In [15]:
df.water_need.max()

600

In [16]:
df.max()

animal        zebra
uniq_id        1022
water_need      600
dtype: object

In [17]:
df.mean() # Mean value - skips strings

uniq_id       1011.500000
water_need     347.727273
dtype: float64

In [18]:
df.median()

uniq_id       1011.5
water_need     325.0
dtype: float64

### Grouping by column value

In [19]:
df.groupby('animal').count()

          uniq_id  water_need
animal
elephant        3           3
kangaroo        3           3
lion            4           4
tiger           5           5
zebra           7           7

In [20]:
# Can group by combinations - here grouped by all combinations of anmal and water_need
df.groupby(['animal', 'water_need']).count().head()

                     uniq_id
animal   water_need
elephant 500               1
         550               1
         600               1
kangaroo 410               2
         430               1

## Example

**In data_2.csv: Whatâ€™s the most frequent source in the dataframe?**

In [21]:
df = pd.read_csv('data_2.csv', delimiter=';', \
                 names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])
df.groupby('source').user_id.count()

source
AdWords    500
Reddit     949
SEO        346
Name: user_id, dtype: int64

**For the users of country_2, what was the most frequent topic and source combination? Or in other words: which topic, from which source, brought the most views from country_2?**

In [22]:
df[df.country == 'country_2'].groupby(['topic', 'source']).count()

                       my_datetime  event  country  user_id
topic         source
Africa        AdWords            3      3        3        3
              Reddit            24     24       24       24
              SEO                7      7        7        7
Asia          AdWords           31     31       31       31
              Reddit           139    139      139      139
              SEO                9      9        9        9
Australia     AdWords            6      6        6        6
              Reddit            18     18       18       18
              SEO               10     10       10       10
Europe        AdWords           46     46       46       46
              Reddit            29     29       29       29
              SEO                4      4        4        4
North America AdWords           11     11       11       11
              Reddit            27     27       27       27
              SEO               42     42       42       42
South America AdWords           14     14       14       14
              Reddit            26     26       26       26
              SEO               16     16       16       16

## PART 3: Important Data Formatting Methods (merge, sort, reset_index, fillna)

### Merging Tables

In [23]:
zoo = pd.read_csv('zoo.csv')
zoo.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [24]:
zoo_eats = pd.DataFrame([['elephant','vegetables'], \
                         ['tiger','meat'], \
                         ['kangaroo','vegetables'], \
                         ['zebra','vegetables'], \
                         ['giraffe','vegetables']], \
                        columns=['animal', 'food'])
zoo_eats.head()

     animal        food
0  elephant  vegetables
1     tiger        meat
2  kangaroo  vegetables
3     zebra  vegetables
4   giraffe  vegetables

In [25]:
# Same as zoo_eats.merge(zoo) - only order will differ; here zoo table data comes first
# Here lion is removed since there is no data for its type in zoo_eats dataframe.
# Girraffe is removed since there is no data for its type in zoo dataframe.
merged = zoo.merge(zoo_eats)
merged.sample(5)

      animal  uniq_id  water_need        food
9      zebra     1010         220  vegetables
8      zebra     1009         200  vegetables
14     zebra     1015          80  vegetables
3      tiger     1004         300        meat
15  kangaroo     1020         410  vegetables

### Meging Methods

![4 - pandas merge inner outer left right](https://data36.com/wp-content/uploads/2018/08/4-pandas-merge-inner-outer-left-right-1024x771.png)

**INNER JOIN** - (default both in SQL and pandas) merge only those values that are found in both tables.

**OUTER JOIN** - merges all values, even if you can find some of them in only one of the tables.

In [26]:
# Explicitly outer join
merged = zoo.merge(zoo_eats, how='outer')
merged.sample(5)

      animal  uniq_id  water_need        food
13     zebra   1014.0       100.0  vegetables
20  kangaroo   1021.0       430.0  vegetables
10     zebra   1011.0       240.0  vegetables
9      zebra   1010.0       220.0  vegetables
18      lion   1019.0       390.0         NaN

In [27]:
# To remove giraffe(which only has a entry in zoo_eats and not in zoo)
merged = zoo.merge(zoo_eats, how='left')
merged.sample(5)

      animal  uniq_id  water_need        food
11     zebra     1012         230  vegetables
3      tiger     1004         300        meat
12     zebra     1013         220  vegetables
2   elephant     1003         550  vegetables
1   elephant     1002         600  vegetables

Mentioning the column in which to merge can also be defines. (Like in foreign keys which column matches to which)

In [28]:
# Here the columns were identified automatically
merged = zoo.merge(zoo_eats, how='left', left_on='animal', right_on='animal')
merged.sample(5)

   animal  uniq_id  water_need        food
17   lion     1018         500         NaN
11  zebra     1012         230  vegetables
12  zebra     1013         220  vegetables
8   zebra     1009         200  vegetables
18   lion     1019         390         NaN

### Sorting

In [29]:
sorted_zoo = zoo.sort_values(by = 'water_need')
sorted_zoo.head()

   animal  uniq_id  water_need
14  zebra     1015          80
13  zebra     1014         100
8   zebra     1009         200
9   zebra     1010         220
12  zebra     1013         220

In [30]:
# Sorting in descending way
sorted_zoo = zoo.sort_values(by = 'water_need', ascending=False)
sorted_zoo.head()

      animal  uniq_id  water_need
1   elephant     1002         600
16      lion     1017         600
2   elephant     1003         550
0   elephant     1001         500
17      lion     1018         500

In [31]:
# Sort by 2 columns (By one first, if same by second)
sorted_zoo = zoo.sort_values(by = ['animal', 'water_need'])
sorted_zoo.head()

      animal  uniq_id  water_need
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
19  kangaroo     1020         410
21  kangaroo     1022         410

### Resetting Index

wrong indexing can mess up visualizations or even machine learning models.

In certain cases, when we have done a transformation on our dataframe, we have to re-index the rows. For that, we can use the `reset_index()` method.

In [32]:
sorted_zoo = zoo.sort_values(by = 'water_need')
sorted_zoo.head()

   animal  uniq_id  water_need
14  zebra     1015          80
13  zebra     1014         100
8   zebra     1009         200
9   zebra     1010         220
12  zebra     1013         220

In [33]:
resetted = sorted_zoo.reset_index()
resetted.head()

   index animal  uniq_id  water_need
0     14  zebra     1015          80
1     13  zebra     1014         100
2      8  zebra     1009         200
3      9  zebra     1010         220
4     12  zebra     1013         220

In [34]:
# Dropping older indeces
resetted = sorted_zoo.reset_index(drop=True)
resetted.head()

  animal  uniq_id  water_need
0  zebra     1015          80
1  zebra     1014         100
2  zebra     1009         200
3  zebra     1010         220
4  zebra     1013         220

## Fill N/A

NaN itself can be really distracting, so we usually replace it with something more meaningful.

In [35]:
zoo.merge(zoo_eats, how = 'left').count()

animal        22
uniq_id       22
water_need    22
food          18
dtype: int64

In [36]:
zoo.merge(zoo_eats, how = 'left').fillna('meat').count()

animal        22
uniq_id       22
water_need    22
food          22
dtype: int64

## Example

**TASK #1: Whatâ€™s the average (mean) revenue between 2018-01-01 and 2018-01-07 from the users in the data_2.csv dataframe?**

**TASK #2: Print the top 3 countries by total revenue between 2018-01-01 and 2018-01-07!**

In [37]:
# Read CSV
travel_blog = pd.read_csv('data_2.csv', delimiter=';',\
                 names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])
blog_buy = pd.read_csv('data_3.csv', delimiter=';', \
                       names = ['my_date_time', 'event', 'user_id', 'amount'])

# Filtering only required data
travel_blog = travel_blog[['user_id', 'my_datetime']]
blog_buy = blog_buy[['amount', 'user_id']]

# Merging dataframes
travel_blog = travel_blog.merge(blog_buy, \
                                how='outer', left_on='user_id', right_on='user_id')

# Querying dates between 2018-01-01 and 2018-01-07
query = travel_blog['2018-01-01' <= travel_blog.my_datetime]
query = query[query.my_datetime <= '2018-01-07']

# Get amounts and fill N/A
amounts = query.amount.fillna(0)

# Get average
amounts.mean()

1.0852367688022284

In [38]:
# Read CSV
travel_blog = pd.read_csv('data_2.csv', delimiter=';',\
                 names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])
blog_buy = pd.read_csv('data_3.csv', delimiter=';', \
                       names = ['my_date_time', 'event', 'user_id', 'amount'])

# Merging dataframes
travel_blog = travel_blog.merge(blog_buy, \
                                how='outer', left_on='user_id', right_on='user_id')

# Fill N/A by 0
travel_blog.amount = travel_blog.amount.fillna(0)

# Group by country and get sums of amount
travel_blog = travel_blog.groupby('country').amount.sum()
# Sort and pront only top 3
travel_blog.sort_values(ascending=False).head(3)

country
country_4    1112.0
country_5     324.0
country_2     296.0
Name: amount, dtype: float64

## Pandas Cheatsheet

![Cheatsheet](pandas_cheatsheet.png)